src/InformationRegisters/CurrencyRates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>CurrencyRates</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ExchangeRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Multiplicity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/BusinessIndividual.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>BusinessIndividual</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Business</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Individual</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Currencies.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>Currencies</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Details</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WritingParameters</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubordinateRateFrom</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubordinateExchangeRateFactor</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DownloadRatesPeriodically</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Companies.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>Companies</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Prefix</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BusinessIndividual</Name>
					<Type>
						<v8:Type>cfg:EnumRef.BusinessIndividual</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Individual</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Individuals</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PrintedName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ContactInformation</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Type</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ContactInformationTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Kind</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ContactInformationKinds</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FieldValues</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Country</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>State</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>City</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Email</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ServerDomainName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumber</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumberNoCodes</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalDataAndAttributes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalDataAndAttributes</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/InfobaseUpdateOverrided/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// INTERFACE PART OF THE OVERRIDED MODULE

// Returns list of IB update handler-procedures for all supported IB versions.
//
// Example of adding of handler-procedure to the list:
//    Handler			 = Handlers.Add();
//    Handler.Version	 = "1.0.0.0";
//    Handler.Procedure  = "IBUpdate.GoToVersion_1_0_0_0";
//
// Called before IB data update start.
//
Function UpdateHandlers() Export
	
	Handlers = InfobaseUpdate.NewUpdateHandlersTable();
	
	// Connecting procedures-handlers of configuration update
	Handler			 	= Handlers.Add();
	Handler.Version 	= "1.0.0.1";
	Handler.Procedure 	= "InfobaseUpdateOverrided.FirstLaunch";
	
	Handler 			= Handlers.Add();
	Handler.Version 	= "1.0.7.5";
	Handler.Procedure 	= "InfobaseUpdateOverrided.Update_1_0_7_5";
	
	Return Handlers;
	
EndFunction // UpdateHandlers()

// Called after completion of infobase data update.
//
// Parameters:
//   PreviousInfobaseVersion     	 - String 	 - IB version before update. "0.0.0.0" for "empty" IB.
//   CurrentInfobaseVersion        - String  	 - IB version after update.
//   ExecutedHandlers 		 - ValueTree - list of executed update handler-procedures,
//                                             grouped by version number.
//  Iteration over the executed handlers:
//		For Each Version In ExecutedHandlers.Rows Do
//
//			If Version.Version = "*" Then
//				group of handlers, that are always executed
//			Else
//				group of handlers, executed for the specific version
//			EndIf;
//
//			For Each Handler In Version.Rows Do
//				...
//			EndDo;
//
//		EndDo;
//
//   OutputUpdatesDetails - Boolean -	if True, then show form with description
//											of the updates.
//
Procedure AfterUpdate(Val PreviousInfobaseVersion, Val CurrentInfobaseVersion, 
	Val ExecutedHandlers, OutputUpdatesDetails) Export
	
EndProcedure

// Called when spreadsheet document with the description of changes is being prepared.
//
// Parameters:
//   Template - SpreadsheetDocument - description of changes.
//
// See. also common template UpdateDetails.
//
Procedure OnPrepareUpdateDescriptionTemplate(Val Template) Export
// Procedure code.
EndProcedure	

///////////////////////////////////////////////////////////////////////////////
// PROCEDURES AND FUNCTIONS OF INFOBASE UPDATE

// Procedure fills empty IB.
//
Procedure FirstLaunch() Export
	
	BeginTransaction();
	
	// 1. Fill currencies.
	NationalCurrencyRef 						= Catalogs.Currencies.NationalCurrency;
	CurrencyNationalCurrency 					= NationalCurrencyRef.GetObject();
	CurrencyNationalCurrency.Description 		= "USD";
	CurrencyNationalCurrency.Details 			= "US Dollar";
	CurrencyNationalCurrency.WritingParameters 	= "dollar, dollar, dollars, m, cent, cent, cents, m, 2";
	
	CurrencyEUR 					= Catalogs.Currencies.CreateItem();
	CurrencyEUR.Code 				= "392";
	CurrencyEUR.Description 		= "EUR";
	CurrencyEUR.Details 			= "Euro";
	CurrencyEUR.WritingParameters 	= "euro, euro, euros, m, cent, cents, cents, m, 2";

	CurrencyYEN 					= Catalogs.Currencies.CreateItem();
	CurrencyYEN.Code 				= "392";
	CurrencyYEN.Description 		= "YEN";
	CurrencyYEN.Details 			= "Yen";
	CurrencyYEN.WritingParameters 	= "yen, yen, yen, m, sen, sen, sen, m, 2";

	CurrencyCNY 					= Catalogs.Currencies.CreateItem();
	CurrencyCNY.Code 				= "156";
	CurrencyCNY.Description 		= "CNY";
	CurrencyCNY.Details 			= "Yuan";
	CurrencyCNY.WritingParameters 	= "yuan, yuan, yuan, m, fen, fen, fen, m, 2";
	
	CurrencyNationalCurrency.Write();
	FillCurrencyRatesFor_11_01_2011(NationalCurrencyRef);
	
	// 2. Fill companies.
	OurCompanyRef = Catalogs.Companies.MainCompany;
	OurCompany = OurCompanyRef.GetObject();
	OurCompany.PrintedName	  		= "Our Company, LLC";
	OurCompany.Prefix				= "OC-";
	OurCompany.BusinessIndividual	= Enums.BusinessIndividual.Business;
	OurCompany.Write();
	
	// 3. Fill constants.
	Constants.ExtractFileTextsAtServer.Set(true);
	
	CommitTransaction();
	
EndProcedure // FirstLaunch()

// Procedure fills currency rates on 11/01/2011.
//
Procedure FillCurrencyRatesFor_11_01_2011(Currency) Export

	RateDate = Date(2011, 11, 1);
	
	RegisterCurrencyRates = InformationRegisters.CurrencyRates.CreateRecordManager();

	RegisterCurrencyRates.Period   = RateDate;
	RegisterCurrencyRates.Currency = Currency;
        
	If RegisterCurrencyRates.Currency.Code 		= "978" Then
		RegisterCurrencyRates.ExchangeRate 		= 42.1833;
		RegisterCurrencyRates.Multiplicity = 1;
    ElsIf RegisterCurrencyRates.Currency.Code 	= "840" Then
        RegisterCurrencyRates.ExchangeRate 		= 30.1245;
		RegisterCurrencyRates.Multiplicity = 1;
	ElsIf RegisterCurrencyRates.Currency.Code	= "392" Then
		RegisterCurrencyRates.ExchangeRate		= 38.1468;
		RegisterCurrencyRates.Multiplicity = 100;
	ElsIf RegisterCurrencyRates.Currency.Code	= "156" Then
		RegisterCurrencyRates.ExchangeRate		= 47.4066;
		RegisterCurrencyRates.Multiplicity = 10;
	EndIf;
	
	RegisterCurrencyRates.Write();

EndProcedure // FillCurrencyRatesFor_11_01_2011()

// Procedure of updates 1.0.7.5.
//
Procedure Update_1_0_7_5() Export

	// insert your handler here
	
EndProcedure // Update_1_0_7_5()
